---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCExtrusionData.ExtrusionDirection
source: html/23d80880-fbcb-63a8-302b-b983dacdb76b.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionData.ExtrusionDirection Property

The direction used for the extrusion.

## Syntax (C#)
```csharp
public XYZ ExtrusionDirection { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null